{
  "src/App.jsx": "This is the main application component that sets up the routing structure and overall layout for the Enchanted Trading platform. It creates a mystical dark theme with animated background elements, gradient overlays, and a navigation bar. The component uses React Router for navigation between the dashboard and signals pages, and Framer Motion for smooth entrance animations.\n\nKeywords: ['routing', 'navigation', 'layout', 'mystical-theme']\nComponent Type: ['layout']\nFunctionality: ['Sets up the main application structure with routing and animated background']\nUse Case: ['Main entry point for the trading application with navigation between different sections']\nRelated Files: ['src/components/TradingDashboard.jsx', 'src/components/SignalGenerator.jsx']",
  "src/components/TradingDashboard.jsx": "This file creates the main trading dashboard interface displaying portfolio statistics, market data, and recent trading signals. It uses mock data services instead of real database connections to avoid build errors while maintaining full functionality. The component features animated cards, real-time price updates, and an enchanted purple theme with magical visual effects.\n\nKeywords: ['dashboard', 'portfolio', 'trading', 'statistics']\nComponent Type: ['UI', 'layout']\nFunctionality: ['Displays trading performance metrics and recent signals with animated statistics cards']\nUse Case: ['Main dashboard view for monitoring trading activity and portfolio performance']\nRelated Files: ['src/components/SignalCard.jsx', 'src/services/MockDataService.js', 'src/components/EnchantedButton.jsx']",
  "src/components/SignalGenerator.jsx": "This file serves as the AI-powered signal generator component for the enchanted trading platform. It provides advanced trading signal generation capabilities with configurable parameters including trading pairs, timeframes, and signal types. The component features real-time signal statistics, interactive controls, and displays generated signals in a grid layout with mystical animations and effects.\n\nKeywords: ['signal', 'generator', 'AI', 'trading', 'analysis', 'configuration']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Generates AI-powered trading signals with customizable parameters and real-time statistics']\nUse Case: ['Creating and managing trading signals for cryptocurrency pairs with technical analysis']\nRelated Files: ['src/components/SignalCard.jsx', 'src/components/EnchantedButton.jsx', 'src/services/MockDataService.js']",
  "src/services/DatabaseService.js": "This file serves as the MySQL database service for the enchanted trading platform. It provides comprehensive database operations including table initialization, signal management, portfolio tracking, trade history, and user settings. The service includes mock data functionality for frontend development and complete MySQL schema documentation for backend implementation.\n\nKeywords: ['MySQL', 'database', 'signals', 'portfolio', 'trades', 'settings']\nComponent Type: ['functional', 'service']\nFunctionality: ['Manages all database operations for trading signals, portfolio data, and user configurations']\nUse Case: ['Storing and retrieving trading data, user preferences, and platform analytics']\nRelated Files: ['src/services/BinanceAPI.js', 'src/components/SignalGenerator.jsx']",
  "src/services/BinanceAPI.js": "This file serves as the comprehensive Binance API integration service for the enchanted trading platform. It provides methods for fetching real-time market data, candlestick charts, order books, account information, and WebSocket connections for live data streaming. The service includes fallback mock data functionality to ensure the platform works even when API access is limited or unavailable.\n\nKeywords: ['Binance', 'API', 'WebSocket', 'market data', 'trading', 'cryptocurrency']\nComponent Type: ['functional', 'service']\nFunctionality: ['Handles all Binance API communications including REST endpoints and WebSocket streaming']\nUse Case: ['Fetching real-time cryptocurrency market data and managing trading operations']\nRelated Files: ['src/services/DatabaseService.js', 'src/components/TradingDashboard.jsx']",
  "src/components/TradingChart.jsx": "This file creates an advanced trading chart component with interactive data visualization capabilities. It uses Recharts library to display real-time market data with multiple viewing options including price, volume, and percentage change metrics. The component features smooth animations, custom tooltips, and responsive design that adapts to different screen sizes.\n\nKeywords: ['trading', 'chart', 'visualization', 'recharts', 'real-time', 'market-data']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Displays interactive trading charts with multiple metrics and real-time data updates']\nUse Case: ['Market analysis', 'price tracking', 'volume analysis', 'trading dashboard']\nRelated Files: ['src/components/TradingDashboard.jsx', 'src/services/BinanceAPI.js']",
  "src/components/SignalCard.jsx": "This file creates individual trading signal cards that display detailed information about each generated signal including price, confidence level, technical indicators, and trading type. Each card features animated hover effects, color-coded styling based on signal type (buy/sell), and interactive elements for executing trades. The design includes magical particle effects and enchanted styling.\n\nKeywords: ['signal', 'card', 'trading', 'indicators']\nComponent Type: ['UI']\nFunctionality: ['Displays individual trading signal information with interactive elements and animations']\nUse Case: ['Showing detailed trading signal data in card format with visual indicators']\nRelated Files: ['src/components/TradingDashboard.jsx', 'src/components/SignalGenerator.jsx']",
  "src/components/EnchantedButton.jsx": "This file creates a magical, animated button component with multiple variants (primary, secondary, danger) and enchanted visual effects. It includes shimmer animations, floating particles, gradient backgrounds, and hover effects that create a mystical user interface element. The button supports disabled states and custom styling while maintaining accessibility.\n\nKeywords: ['button', 'animated', 'enchanted', 'magical']\nComponent Type: ['UI']\nFunctionality: ['Provides interactive button with magical animations and multiple style variants']\nUse Case: ['Primary action buttons throughout the application with enchanted styling']\nRelated Files: ['src/components/TradingDashboard.jsx', 'src/components/SignalGenerator.jsx']",
  "src/services/MockDataService.js": "This file provides a mock data service that simulates database operations and API calls without requiring actual backend connections. It generates realistic trading signals, portfolio data, and market statistics for demonstration purposes. The service includes methods for creating, retrieving, and updating trading data while maintaining the same interface as a real database service.\n\nKeywords: ['mock', 'data', 'service', 'simulation']\nComponent Type: ['functional']\nFunctionality: ['Simulates database operations and provides mock trading data for frontend components']\nUse Case: ['Development and demonstration without requiring backend infrastructure']\nRelated Files: ['src/components/TradingDashboard.jsx', 'src/components/SignalGenerator.jsx']",
  "src/components/Navbar.jsx": "This file creates the main navigation bar component for the enchanted trading platform. It provides a responsive navigation system with mystical styling, animated elements, and comprehensive routing to all platform pages. The navbar includes a magical logo with rotation animation, gradient backgrounds, and active state indicators with smooth transitions.\n\nKeywords: ['navigation', 'navbar', 'routing', 'responsive', 'animated']\nComponent Type: ['layout', 'UI']\nFunctionality: ['Provides main navigation between all platform pages with responsive design and magical animations']\nUse Case: ['Primary navigation component used across all pages of the trading platform']\nRelated Files: ['src/App.jsx', 'src/components/Footer.jsx']",
  "src/pages/Portfolio.jsx": "This file serves as the portfolio management page for the enchanted trading platform. It displays comprehensive portfolio information including total value, profit/loss calculations, available balance, and detailed holdings breakdown. The component features real-time data updates, privacy controls for sensitive information, and a professional table layout for asset management with mystical design elements.\n\nKeywords: ['portfolio', 'holdings', 'PnL', 'balance', 'assets', 'trading']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Displays portfolio performance metrics and manages asset holdings with real-time updates']\nUse Case: ['Tracking trading portfolio performance and managing cryptocurrency holdings']\nRelated Files: ['src/components/EnchantedButton.jsx', 'src/services/BinanceAPI.js']",
  "src/pages/Settings.jsx": "This file serves as the comprehensive settings configuration page for the enchanted trading platform. It provides a tabbed interface for managing API credentials, database connections, notification preferences, trading parameters, and UI customization options. The component handles Binance API key management, MySQL database configuration, and various user preferences with a mystical dark theme design.\n\nKeywords: ['settings', 'configuration', 'API', 'database', 'notifications', 'trading']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Manages platform configuration settings and user preferences with tabbed navigation']\nUse Case: ['Configuring Binance API credentials and MySQL database connection for trading operations']\nRelated Files: ['src/components/EnchantedButton.jsx', 'src/services/BinanceAPI.js', 'src/services/DatabaseService.js']",
  "src/pages/Profile.jsx": "This file creates a comprehensive user profile page for the trading platform. It displays user information, trading statistics, bio, and trading preferences with edit functionality. The component includes avatar display, contact information management, and trading performance metrics with a mystical design theme.\n\nKeywords: ['profile', 'user', 'statistics', 'preferences', 'editing']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Manages user profile information, displays trading statistics, and provides editing capabilities']\nUse Case: ['User account management and profile customization']\nRelated Files: ['src/components/EnchantedButton.jsx', 'src/services/DatabaseService.js']",
  "src/pages/TradingHistory.jsx": "This file creates a comprehensive trading history page that displays all past and current trades with advanced filtering and search capabilities. It includes detailed trade information, P&L calculations, status indicators, and export functionality with a professional table layout and mystical design elements.\n\nKeywords: ['trading', 'history', 'transactions', 'filtering', 'export']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Displays trading history with filtering, searching, and export capabilities for trade analysis']\nUse Case: ['Trade history review and performance analysis for traders']\nRelated Files: ['src/components/EnchantedButton.jsx', 'src/services/DatabaseService.js']",
  "src/pages/Backtesting.jsx": "This file creates a comprehensive backtesting page for testing trading strategies with historical data. It includes strategy configuration, risk management parameters, real-time progress tracking, and detailed performance results with metrics like win rate, Sharpe ratio, and drawdown analysis.\n\nKeywords: ['backtesting', 'strategy', 'testing', 'performance', 'analysis']\nComponent Type: ['UI', 'functional']\nFunctionality: ['Provides backtesting interface for trading strategies with configuration options and detailed results']\nUse Case: ['Strategy validation and performance analysis using historical market data']\nRelated Files: ['src/components/EnchantedButton.jsx', 'src/services/DatabaseService.js']",
  "src/pages/SpotTrading.jsx": "This file creates a comprehensive spot trading interface for the enchanted trading platform. It provides real-time market data display, order placement functionality, wallet balance tracking, and recent trade history. The component features a mystical dark theme with purple gradients and includes interactive elements for buying and selling cryptocurrencies with both market and limit order types.\n\nKeywords: ['spot trading', 'cryptocurrency', 'market orders', 'wallet balance', 'trading interface']\nComponent Type: ['trading', 'UI', 'functional']\nFunctionality: ['Enables spot trading with order placement and market data visualization']\nUse Case: ['Primary trading interface for buying and selling cryptocurrencies']\nRelated Files: ['src/App.jsx', 'src/components/Navbar.jsx']",
  "src/pages/MarginTrading.jsx": "This file creates a comprehensive margin trading interface with leverage controls, position management, and risk monitoring. It displays margin account balances, allows users to open long/short positions with various leverage options, and tracks open positions with real-time P&L calculations. The component includes stop-loss and take-profit functionality with a mystical dark theme consistent with the platform design.\n\nKeywords: ['margin trading', 'leverage', 'positions', 'risk management', 'futures trading']\nComponent Type: ['trading', 'UI', 'functional']\nFunctionality: ['Enables leveraged trading with position management and risk controls']\nUse Case: ['Advanced trading interface for margin and futures trading']\nRelated Files: ['src/App.jsx', 'src/components/Navbar.jsx', 'src/pages/RiskManagement.jsx']",
  "src/pages/RiskManagement.jsx": "This file creates a comprehensive risk management dashboard for the trading platform. It includes position sizing calculators, risk metrics monitoring, portfolio risk analysis, and customizable risk settings. The component provides tools for calculating optimal position sizes based on risk tolerance, tracking key risk metrics like VaR and drawdown, and managing risk alerts with real-time notifications.\n\nKeywords: ['risk management', 'position sizing', 'portfolio risk', 'risk metrics', 'trading safety']\nComponent Type: ['analytics', 'UI', 'functional']\nFunctionality: ['Provides comprehensive risk analysis and position sizing tools for safe trading']\nUse Case: ['Essential tool for managing trading risks and calculating position sizes']\nRelated Files: ['src/App.jsx', 'src/pages/MarginTrading.jsx', 'src/components/Navbar.jsx']",
  "src/pages/MarketAnalysis.jsx": "This file creates a comprehensive market analysis dashboard with technical indicators, sentiment analysis, and market overview metrics. It provides real-time technical analysis data including RSI, MACD, and moving averages, market sentiment tracking from various sources, correlation analysis between different cryptocurrencies, and top movers identification with customizable timeframes and indicators.\n\nKeywords: ['market analysis', 'technical indicators', 'sentiment analysis', 'correlation matrix', 'market overview']\nComponent Type: ['analytics', 'UI', 'functional']\nFunctionality: ['Provides comprehensive market analysis tools and technical indicators for trading decisions']\nUse Case: ['Essential tool for market research and technical analysis before making trading decisions']\nRelated Files: ['src/App.jsx', 'src/components/Navbar.jsx', 'src/pages/SpotTrading.jsx']",
  "src/pages/Alerts.jsx": "This file creates a comprehensive alert management system for the trading platform. It allows users to create, manage, and monitor custom price and technical indicator alerts with real-time notifications. The component includes alert creation forms, active alert management, alert history tracking, and statistics dashboard with support for various alert types including price, volume, RSI, and MACD alerts.\n\nKeywords: ['price alerts', 'notifications', 'alert management', 'technical indicators', 'trading signals']\nComponent Type: ['notification', 'UI', 'functional']\nFunctionality: ['Enables users to create and manage custom trading alerts with various trigger conditions']\nUse Case: ['Essential tool for monitoring market conditions and receiving notifications for trading opportunities']\nRelated Files: ['src/App.jsx', 'src/components/Navbar.jsx', 'src/pages/MarketAnalysis.jsx']",
  "src/pages/Help.jsx": "This file serves as the comprehensive Help page for the enchanted trading platform, providing users with detailed FAQ sections, trading guides, and support resources. The component features a mystical design with animated backgrounds, categorized help topics, and interactive elements that maintain consistency with the platform's enchanted theme. It includes searchable FAQ sections covering general questions, trading strategies, security concerns, and technical support, along with quick contact options and educational guides for users of all skill levels.\n\nKeywords: ['help', 'faq', 'support', 'guides', 'documentation', 'trading-help']\nComponent Type: ['UI', 'informational']\nFunctionality: ['Provides comprehensive user support with categorized FAQ sections, search functionality, and educational resources']\nUse Case: ['User support and documentation, troubleshooting assistance, educational content for trading platform users']\nRelated Files: ['src/App.jsx', 'src/components/Navbar.jsx']"
}